package lesson5;

public class Main2 {
    public static void main(String[] args) {
        String[][] turs = {
                {"Египет", "5", "Самолет", "30000"},
                {"Турция", "5", "Самолет", "40000"},
                {"Стамул", "2", "Поезд", "25000"},
                {"Сочи", "3", "Автобус", "10000"},
                {"Крым", "4", "Поезд", "60000"},
                {"Египет", "4", "Самолет", "20000"},
                {"Америка", "5", "Самолет", "90000"}
        };

        Ture.getCoutry(turs, "Египет");
        System.out.println("______________");
        Ture.getCoutry(turs, "Египет", 25000);

        System.out.println("______________");

        int t = Ture.getTyreStars(turs, 5);

        //1)метод в который передаем массив и диапазон цен,
        // и надо вывевести все в этом диапазоне между 30 и 50 тысяч
        // 2)метод в который передаем массив и диапазон звезд   3 и 4 включительно
        // 3) метод в который передаем массив и на чем не хочет ехать
        // вывести все туры кроме него(автобус)

        Ture.getTurePrice(turs,35000, 65000);
        System.out.println();
        Ture.getTureTransport(turs,"Автобус");



    }
}
